In [33]:
import pandas as pd 
# import kagglehub

In [34]:
# # Download dataset from Kaggle
# path = kagglehub.dataset_download("gregorut/videogamesales")
# print("Path to dataset files:", path)

In [35]:
# Load data from a CSV file into a DataFrame
df = pd.read_csv('mock_data.csv')
# df = pd.read_csv(f'{path}/vgsales.csv')

In [36]:
df.head()  # Display the first few rows of the DataFrame

,id,name,age,salary,hire_date,profile,department,bonus
0,1,Name_103,77.0,60000.0,2019-12-30,"{""address"": ""Street 37, City 13"", ""phone"": ""59...",Marketing,3436.0
1,2,Name_436,62.0,50000.0,2025-05-08,"{""address"": ""Street 46, City 47"", ""phone"": ""87...",Marketing,6988.0
2,3,Name_861,61.0,60000.0,2019-06-03,"{""address"": ""Street 63, City 1"", ""phone"": ""211...",HR,7407.0
3,4,Name_271,36.0,70000.0,2024-02-10,"{""address"": ""Street 92, City 26"", ""phone"": ""59...",NaN,6192.0
4,5,Name_107,78.0,60000.0,NaN,"{""address"": ""Street 45, City 5"", ""phone"": ""694...",IT,3924.0

In [37]:
# get a summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20000 non-null  int64
 1   name        20000 non-null  object
 2   age         19000 non-null  float64
 3   salary      13519 non-null  float64
 4   hire_date   18047 non-null  object
 5   profile     17946 non-null  object
 6   department  16003 non-null  object
 7   bonus       18026 non-null  float64
dtypes: float64(3), int64(1), object(4)
memory usage: 1.2+ MB

In [38]:
# Check for missing values
df.isnull().sum()

id               0
name             0
age           1000
salary        6481
hire_date     1953
profile       2054
department    3997
bonus         1974
dtype: int64

In [39]:
# View statistical summary of numerical columns
df.describe(include='all')

,id,name,age,salary,hire_date,profile,department,bonus
count,20000.000000,20000,19000.000000,13519.000000,18047,17946,16003,18026.000000
unique,NaN,999,NaN,NaN,3621,17946,4,NaN
top,NaN,Name_825,NaN,NaN,2017-11-04,"{""address"": ""Street 37, City 13"", ""phone"": ""59...",IT,NaN
freq,NaN,37,NaN,NaN,17,1,4058,NaN
mean,10000.500000,NaN,48.444684,59962.275316,NaN,NaN,NaN,5490.596583
std,5773.647028,NaN,17.892848,8200.588356,NaN,NaN,NaN,2591.551271
min,1.000000,NaN,18.000000,50000.000000,NaN,NaN,NaN,1000.000000
25%,5000.750000,NaN,33.000000,50000.000000,NaN,NaN,NaN,3252.000000
50%,10000.500000,NaN,48.000000,60000.000000,NaN,NaN,NaN,5502.000000
75%,15000.250000,NaN,64.000000,70000.000000,NaN,NaN,NaN,7737.000000
max,20000.000000,NaN,79.000000,70000.000000,NaN,NaN,NaN,10000.000000

In [40]:
# check the ununique values in a specific column
df['age'].unique()

array([77., 62., 61., 36., 78., 35., 73., 18., 42., 44., 24., 59., 46.,
       48., 60., 53., 23., 26., 37., 27., 54., 30., 58., 19., 67., 38.,
       50., 41., 70., 51., 72., 47., nan, 63., 28., 34., 33., 52., 43.,
       75., 29., 79., 45., 22., 69., 66., 71., 65., 32., 25., 40., 31.,
       39., 55., 49., 20., 68., 57., 56., 74., 64., 21., 76.])

In [41]:
# Step 1: handle missing values
print("Filling missing values in each column with the median of that column.")
df['age'].fillna(df['age'].median(), inplace=True)
df['salary'].fillna(df['salary'].median(), inplace=True)


# Filling missing values in department with unknown
df['department'].fillna('Unknown', inplace=True) 

# Print the sample data after handling missing values
print("\nSample data after handling missing values:")
print(df.head())

Filling missing values in each column with the median of that column.

Sample data after handling missing values:
   id      name   age   salary   hire_date  \
0   1  Name_103  77.0  60000.0  2019-12-30
1   2  Name_436  62.0  50000.0  2025-05-08
2   3  Name_861  61.0  60000.0  2019-06-03
3   4  Name_271  36.0  70000.0  2024-02-10
4   5  Name_107  78.0  60000.0         NaN

                                             profile department   bonus
0  {"address": "Street 37, City 13", "phone": "59...  Marketing  3436.0
1  {"address": "Street 46, City 47", "phone": "87...  Marketing  6988.0
2  {"address": "Street 63, City 1", "phone": "211...         HR  7407.0
3  {"address": "Street 92, City 26", "phone": "59...    Unknown  6192.0
4  {"address": "Street 45, City 5", "phone": "694...         IT  3924.0

In [ ]:
# Convert 'profile' from JSON string to dictionary (handling empty strings)
import json
df['profile'] = df['profile'].apply(lambda x: json.loads(x) if pd.notnull(x) else {})

In [43]:
print("\nSample data after converting 'profile' column:")
print(df[['profile']].head())

Sample data after converting 'profile' column:
                                             profile
0  {'address': 'Street 37, City 13', 'phone': '59...
1  {'address': 'Street 46, City 47', 'phone': '87...
2  {'address': 'Street 63, City 1', 'phone': '211...
3  {'address': 'Street 92, City 26', 'phone': '59...
4  {'address': 'Street 45, City 5', 'phone': '694...